Situation (Very Realistic)

You are monitoring a patientâ€™s heart rate every minute in the ICU.

Heart rate naturally fluctuates

Doctors donâ€™t react to every fluctuation

They care about:

Baseline trend â†’ Is HR generally increasing?

Stability â†’ Is HR becoming erratic?

ðŸ‘‰ This is exactly where
rolling mean + rolling std are used.

In [1]:
import pandas as pd

hr_data = [72, 74, 73, 75, 74, 120, 130, 125, 122, 118]

df = pd.DataFrame({
    "Minute": range(len(hr_data)),
    "Heart_Rate": hr_data
})

df

   Minute  Heart_Rate
0       0          72
1       1          74
2       2          73
3       3          75
4       4          74
5       5         120
6       6         130
7       7         125
8       8         122
9       9         118

In [2]:
df["HR_mean_3"] = df["Heart_Rate"].rolling(3).mean()

In [3]:
df

   Minute  Heart_Rate   HR_mean_3
0       0          72         NaN
1       1          74         NaN
2       2          73   73.000000
3       3          75   74.000000
4       4          74   74.000000
5       5         120   89.666667
6       6         130  108.000000
7       7         125  125.000000
8       8         122  125.666667
9       9         118  121.666667

In [4]:
df["HR_std_3"]= df["Heart_Rate"].rolling(3).std()

In [5]:
df

   Minute  Heart_Rate   HR_mean_3   HR_std_3
0       0          72         NaN        NaN
1       1          74         NaN        NaN
2       2          73   73.000000   1.000000
3       3          75   74.000000   1.000000
4       4          74   74.000000   1.000000
5       5         120   89.666667  26.274195
6       6         130  108.000000  29.866369
7       7         125  125.000000   5.000000
8       8         122  125.666667   4.041452
9       9         118  121.666667   3.511885

In [6]:
df["alert"] = df["Heart_Rate"] > (df["HR_mean_3"]+2 * df["HR_std_3"])

In [7]:
df

   Minute  Heart_Rate   HR_mean_3   HR_std_3  alert
0       0          72         NaN        NaN  False
1       1          74         NaN        NaN  False
2       2          73   73.000000   1.000000  False
3       3          75   74.000000   1.000000  False
4       4          74   74.000000   1.000000  False
5       5         120   89.666667  26.274195  False
6       6         130  108.000000  29.866369  False
7       7         125  125.000000   5.000000  False
8       8         122  125.666667   4.041452  False
9       9         118  121.666667   3.511885  False